benchmarks/results/2026-08-10/accept-batching-local-fallback-final/batch-1-connection-burst.wrk.txt
Running 10s test @ http://127.0.0.1:19169/health
  4 threads and 120 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.90ms    2.57ms   8.07ms   72.73%
    Req/Sec    27.50     23.63    60.00     75.00%
  Latency Distribution
     50%    3.09ms
     75%    7.42ms
     90%    7.77ms
     99%    8.07ms
  11 requests in 10.03s, 6.20KB read
  Socket errors: connect 120, read 0, write 0, timeout 0
Requests/sec:      1.10
Transfer/sec:     632.99B

WRK_SUMMARY {"rps":1.10,"p50_ms":3.094,"p95_ms":8.073,"p99_ms":8.073,"p999_ms":8.073,"errors":120,"throughput_mbps":0.00}