benchmarks/results/2026-08-10/accept-batching-local-fallback-final/batch-1-mixed-keepalive-churn-keepalive.wrk.txt
Running 10s test @ http://127.0.0.1:19169/health
  4 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.51us  410.46us   4.14ms   99.00%
    Req/Sec     1.00k     0.00     1.00k   100.00%
  Latency Distribution
     50%   38.00us
     75%   47.00us
     90%   55.00us
     99%    4.14ms
  100 requests in 10.10s, 56.84KB read
  Socket errors: connect 28, read 1, write 0, timeout 0
Requests/sec:      9.90
Transfer/sec:      5.63KB

WRK_SUMMARY {"rps":9.90,"p50_ms":0.038,"p95_ms":0.062,"p99_ms":4.145,"p999_ms":4.145,"errors":29,"throughput_mbps":0.01}