benchmarks/results/2026-08-10/accept-batching-local-fallback-final/batch-64-connection-churn.wrk.txt
Running 10s test @ http://127.0.0.1:19169/health
  4 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.21ms    9.79ms 188.53ms   99.15%
    Req/Sec     7.38k     3.49k   12.65k    74.84%
  Latency Distribution
     50%  341.00us
     75%  405.00us
     90%  580.00us
     99%    7.49ms
  114812 requests in 10.08s, 63.18MB read
  Socket errors: connect 28, read 0, write 0, timeout 0
Requests/sec:  11384.73
Transfer/sec:      6.26MB

WRK_SUMMARY {"rps":11384.73,"p50_ms":0.341,"p95_ms":0.900,"p99_ms":7.486,"p999_ms":167.021,"errors":28,"throughput_mbps":6.26}