benchmarks/results/2026-08-10/accept-batching-local-fallback-final/batch-64-fair-8-mixed-keepalive-churn-churn.wrk.txt
Running 10s test @ http://127.0.0.1:19169/health
  4 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  Latency Distribution
     50%    0.00us
     75%    0.00us
     90%    0.00us
     99%    0.00us
  0 requests in 10.10s, 0.00B read
  Socket errors: connect 28, read 0, write 0, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B

WRK_SUMMARY {"rps":0.00,"p50_ms":0.000,"p95_ms":0.000,"p99_ms":0.000,"p999_ms":0.000,"errors":28,"throughput_mbps":0.00}