benchmarks/results/2026-08-10/accept-batching-local-fallback-final/batch-64-fair-8-mixed-keepalive-churn-keepalive.wrk.txt
Running 10s test @ http://127.0.0.1:19169/health
  4 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.48us  323.48us   3.27ms   99.00%
    Req/Sec     1.00k     0.00     1.00k   100.00%
  Latency Distribution
     50%   36.00us
     75%   43.00us
     90%   58.00us
     99%    3.27ms
  100 requests in 10.10s, 56.84KB read
  Socket errors: connect 28, read 1, write 0, timeout 0
Requests/sec:      9.90
Transfer/sec:      5.63KB

WRK_SUMMARY {"rps":9.90,"p50_ms":0.036,"p95_ms":0.067,"p99_ms":3.274,"p999_ms":3.274,"errors":29,"throughput_mbps":0.01}