benchmarks/results/2026-08-10/accept-batching-local-fallback-final/sharded-batch-64-connection-burst.wrk.txt
Running 10s test @ http://127.0.0.1:19169/health
  4 threads and 120 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    88.18us  327.99us   5.57ms   98.25%
    Req/Sec     2.30k   447.83     2.76k    60.00%
  Latency Distribution
     50%   50.00us
     75%   58.00us
     90%   71.00us
     99%    0.90ms
  1146 requests in 10.04s, 645.74KB read
  Socket errors: connect 120, read 0, write 0, timeout 0
Requests/sec:    114.12
Transfer/sec:     64.31KB

WRK_SUMMARY {"rps":114.12,"p50_ms":0.050,"p95_ms":0.126,"p99_ms":0.895,"p999_ms":5.350,"errors":120,"throughput_mbps":0.06}