benchmarks/results/2026-08-10/accept-batching-local-fallback-final/sharded-batch-64-mixed-keepalive-churn-churn.wrk.txt
Running 10s test @ http://127.0.0.1:19169/health
  4 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    97.00us    0.00us  97.00us  100.00%
    Req/Sec     9.00      0.00     9.00    100.00%
  Latency Distribution
     50%   97.00us
     75%   97.00us
     90%   97.00us
     99%   97.00us
  1 requests in 10.10s, 577.00B read
  Socket errors: connect 28, read 0, write 0, timeout 0
Requests/sec:      0.10
Transfer/sec:      57.11B

WRK_SUMMARY {"rps":0.10,"p50_ms":0.097,"p95_ms":0.097,"p99_ms":0.097,"p999_ms":0.097,"errors":28,"throughput_mbps":0.00}