benchmarks/results/2026-08-10/accept-batching-local-fallback-final/sharded-batch-64-mixed-keepalive-churn-keepalive.wrk.txt
Running 10s test @ http://127.0.0.1:19169/health
  4 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.42us   38.33us   4.26ms   97.80%
    Req/Sec    23.22k     6.56k   31.27k    66.67%
  Latency Distribution
     50%   30.00us
     75%   40.00us
     90%   50.00us
     99%  108.00us
  41600 requests in 10.11s, 23.09MB read
  Socket errors: connect 28, read 416, write 0, timeout 0
Requests/sec:   4116.23
Transfer/sec:      2.28MB

WRK_SUMMARY {"rps":4116.23,"p50_ms":0.030,"p95_ms":0.059,"p99_ms":0.108,"p999_ms":0.478,"errors":444,"throughput_mbps":2.28}